QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EA48def.inc
; FUSE_WDTCFG masks
.equ FUSE_PERIOD_gm = 0x0F               ; Watchdog Timeout Period group mask
.equ FUSE_PERIOD_gp = 0                  ; Watchdog Timeout Period group position
.equ FUSE_PERIOD_0_bm = (1<<0)           ; Watchdog Timeout Period bit 0 mask
.equ FUSE_PERIOD_0_bp = 0                ; Watchdog Timeout Period bit 0 position
.equ FUSE_PERIOD_1_bm = (1<<1)           ; Watchdog Timeout Period bit 1 mask
.equ FUSE_PERIOD_1_bp = 1                ; Watchdog Timeout Period bit 1 position
.equ FUSE_PERIOD_2_bm = (1<<2)           ; Watchdog Timeout Period bit 2 mask
.equ FUSE_PERIOD_2_bp = 2                ; Watchdog Timeout Period bit 2 position
.equ FUSE_PERIOD_3_bm = (1<<3)           ; Watchdog Timeout Period bit 3 mask
.equ FUSE_PERIOD_3_bp = 3                ; Watchdog Timeout Period bit 3 position
.equ FUSE_WINDOW_gm = 0xF0               ; Watchdog Window Timeout Period group mask
.equ FUSE_WINDOW_gp = 4                  ; Watchdog Window Timeout Period group position
.equ FUSE_WINDOW_0_bm = (1<<4)           ; Watchdog Window Timeout Period bit 0 mask
.equ FUSE_WINDOW_0_bp = 4                ; Watchdog Window Timeout Period bit 0 position
.equ FUSE_WINDOW_1_bm = (1<<5)           ; Watchdog Window Timeout Period bit 1 mask
.equ FUSE_WINDOW_1_bp = 5                ; Watchdog Window Timeout Period bit 1 position
.equ FUSE_WINDOW_2_bm = (1<<6)           ; Watchdog Window Timeout Period bit 2 mask
.equ FUSE_WINDOW_2_bp = 6                ; Watchdog Window Timeout Period bit 2 position
.equ FUSE_WINDOW_3_bm = (1<<7)           ; Watchdog Window Timeout Period bit 3 mask
.equ FUSE_WINDOW_3_bp = 7                ; Watchdog Window Timeout Period bit 3 position

; FUSE_BODCFG masks
.equ FUSE_SLEEP_gm = 0x03                ; BOD Operation in Sleep Mode group mask
.equ FUSE_SLEEP_gp = 0                   ; BOD Operation in Sleep Mode group position
.equ FUSE_SLEEP_0_bm = (1<<0)            ; BOD Operation in Sleep Mode bit 0 mask
.equ FUSE_SLEEP_0_bp = 0                 ; BOD Operation in Sleep Mode bit 0 position
.equ FUSE_SLEEP_1_bm = (1<<1)            ; BOD Operation in Sleep Mode bit 1 mask
.equ FUSE_SLEEP_1_bp = 1                 ; BOD Operation in Sleep Mode bit 1 position
.equ FUSE_ACTIVE_gm = 0x0C               ; BOD Operation in Active Mode group mask
.equ FUSE_ACTIVE_gp = 2                  ; BOD Operation in Active Mode group position
.equ FUSE_ACTIVE_0_bm = (1<<2)           ; BOD Operation in Active Mode bit 0 mask
.equ FUSE_ACTIVE_0_bp = 2                ; BOD Operation in Active Mode bit 0 position
.equ FUSE_ACTIVE_1_bm = (1<<3)           ; BOD Operation in Active Mode bit 1 mask
.equ FUSE_ACTIVE_1_bp = 3                ; BOD Operation in Active Mode bit 1 position
.equ FUSE_SAMPFREQ_bm = 0x10             ; BOD Sample Frequency bit mask
.equ FUSE_SAMPFREQ_bp = 4                ; BOD Sample Frequency bit position
.equ FUSE_LVL_gm = 0xE0                  ; BOD Level group mask
.equ FUSE_LVL_gp = 5                     ; BOD Level group position
.equ FUSE_LVL_0_bm = (1<<5)              ; BOD Level bit 0 mask
.equ FUSE_LVL_0_bp = 5                   ; BOD Level bit 0 position
.equ FUSE_LVL_1_bm = (1<<6)              ; BOD Level bit 1 mask
.equ FUSE_LVL_1_bp = 6                   ; BOD Level bit 1 position
.equ FUSE_LVL_2_bm = (1<<7)              ; BOD Level bit 2 mask
.equ FUSE_LVL_2_bp = 7                   ; BOD Level bit 2 position

; FUSE_OSCCFG masks
.equ FUSE_OSCHFFRQ_bm = 0x08             ; High-frequency Oscillator Frequency bit mask
.equ FUSE_OSCHFFRQ_bp = 3                ; High-frequency Oscillator Frequency bit position

; FUSE_SYSCFG0 masks
.equ FUSE_EESAVE_bm = 0x01               ; EEPROM Save bit mask
.equ FUSE_EESAVE_bp = 0                  ; EEPROM Save bit position
.equ FUSE_RSTPINCFG_bm = 0x08            ; Reset Pin Configuration bit mask
.equ FUSE_RSTPINCFG_bp = 3               ; Reset Pin Configuration bit position
.equ FUSE_UPDIPINCFG_bm = 0x10           ; UPDI Pin Configuration bit mask
.equ FUSE_UPDIPINCFG_bp = 4              ; UPDI Pin Configuration bit position
.equ FUSE_CRCSEL_bm = 0x20               ; CRC Select bit mask
.equ FUSE_CRCSEL_bp = 5                  ; CRC Select bit position
.equ FUSE_CRCSRC_gm = 0xC0               ; CRC Source group mask
.equ FUSE_CRCSRC_gp = 6                  ; CRC Source group position
.equ FUSE_CRCSRC_0_bm = (1<<6)           ; CRC Source bit 0 mask
.equ FUSE_CRCSRC_0_bp = 6                ; CRC Source bit 0 position
.equ FUSE_CRCSRC_1_bm = (1<<7)           ; CRC Source bit 1 mask
.equ FUSE_CRCSRC_1_bp = 7                ; CRC Source bit 1 position

; FUSE_SYSCFG1 masks
.equ FUSE_SUT_gm = 0x07                  ; Startup Time group mask
.equ FUSE_SUT_gp = 0                     ; Startup Time group position
.equ FUSE_SUT_0_bm = (1<<0)              ; Startup Time bit 0 mask
.equ FUSE_SUT_0_bp = 0                   ; Startup Time bit 0 position
.equ FUSE_SUT_1_bm = (1<<1)              ; Startup Time bit 1 mask
.equ FUSE_SUT_1_bp = 1                   ; Startup Time bit 1 position
.equ FUSE_SUT_2_bm = (1<<2)              ; Startup Time bit 2 mask
.equ FUSE_SUT_2_bp = 2                   ; Startup Time bit 2 position

; BOD Operation in Active Mode select
.equ FUSE_ACTIVE_DISABLE_gc = (0x00<<2)  ; Disabled
.equ FUSE_ACTIVE_ENABLED_gc = (0x01<<2)  ; Enabled in continuous mode
.equ FUSE_ACTIVE_SAMPLED_gc = (0x02<<2)  ; Enabled in sampled mode
.equ FUSE_ACTIVE_ENABLEWAIT_gc = (0x03<<2) ; Enabled in continuous mode. Execution halted at wake-up until BOD is running

; BOD Level select
.equ FUSE_LVL_BODLEVEL0_gc = (0x00<<5)   ; BOD Disabled during normal operation
.equ FUSE_LVL_BODLEVEL1_gc = (0x01<<5)   ; 1.9 V
.equ FUSE_LVL_BODLEVEL2_gc = (0x02<<5)   ; 2.7 V
.equ FUSE_LVL_BODLEVEL3_gc = (0x03<<5)   ; 4.5 V

; BOD Sample Frequency select
.equ FUSE_SAMPFREQ_128HZ_gc = (0x00<<4)  ; Sampling frequency is 128 Hz
.equ FUSE_SAMPFREQ_32HZ_gc = (0x01<<4)   ; Sample frequency is 32 Hz

; BOD Operation in Sleep Mode select
.equ FUSE_SLEEP_DISABLE_gc = (0x00<<0)   ; Disabled
.equ FUSE_SLEEP_ENABLE_gc = (0x01<<0)    ; Enabled in continuous mode
.equ FUSE_SLEEP_SAMPLE_gc = (0x02<<0)    ; Enabled in sampled mode

; High-frequency Oscillator Frequency select
.equ FUSE_OSCHFFRQ_20M_gc = (0x00<<3)    ; OSCHF running at 20 MHz
.equ FUSE_OSCHFFRQ_16M_gc = (0x01<<3)    ; OSCHF running at 16 MHz

; CRC Select
.equ FUSE_CRCSEL_CRC16_gc = (0x00<<5)    ; Enable CRC16
.equ FUSE_CRCSEL_CRC32_gc = (0x01<<5)    ; Enable CRC32

; CRC Source select
.equ FUSE_CRCSRC_FLASH_gc = (0x00<<6)    ; CRC of full Flash (boot, application code and application data)
.equ FUSE_CRCSRC_BOOT_gc = (0x01<<6)     ; CRC of boot section
.equ FUSE_CRCSRC_BOOTAPP_gc = (0x02<<6)  ; CRC of application code and boot sections
.equ FUSE_CRCSRC_NOCRC_gc = (0x03<<6)    ; No CRC

; EEPROM Save select
.equ FUSE_EESAVE_DISABLE_gc = (0x00<<0)  ; EEPROM content is erased during chip erase
.equ FUSE_EESAVE_ENABLE_gc = (0x01<<0)   ; EEPROM content is preserved during chip erase

; Reset Pin Configuration select
.equ FUSE_RSTPINCFG_NONE_gc = (0x00<<3)  ; No External Reset
.equ FUSE_RSTPINCFG_RESET_gc = (0x01<<3) ; PF6 configured as RESET pin

; UPDI Pin Configuration select
.equ FUSE_UPDIPINCFG_GPIO_gc = (0x00<<4) ; PF7 Configured as GPIO pin
.equ FUSE_UPDIPINCFG_UPDI_gc = (0x01<<4) ; PF7 Configured as UPDI pin

; Startup Time select
.equ FUSE_SUT_0MS_gc = (0x00<<0)         ; 0 ms
.equ FUSE_SUT_1MS_gc = (0x01<<0)         ; 1 ms
.equ FUSE_SUT_2MS_gc = (0x02<<0)         ; 2 ms
.equ FUSE_SUT_4MS_gc = (0x03<<0)         ; 4 ms
.equ FUSE_SUT_8MS_gc = (0x04<<0)         ; 8 ms
.equ FUSE_SUT_16MS_gc = (0x05<<0)        ; 16 ms
.equ FUSE_SUT_32MS_gc = (0x06<<0)        ; 32 ms
.equ FUSE_SUT_64MS_gc = (0x07<<0)        ; 64 ms

; Watchdog Timeout Period select
.equ FUSE_PERIOD_OFF_gc = (0x00<<0)      ; Watch-Dog timer Off
.equ FUSE_PERIOD_8CLK_gc = (0x01<<0)     ; 8 cycles (8ms)
.equ FUSE_PERIOD_16CLK_gc = (0x02<<0)    ; 16 cycles (16ms)
.equ FUSE_PERIOD_32CLK_gc = (0x03<<0)    ; 32 cycles (32ms)
.equ FUSE_PERIOD_64CLK_gc = (0x04<<0)    ; 64 cycles (64ms)
.equ FUSE_PERIOD_128CLK_gc = (0x05<<0)   ; 128 cycles (0.128s)
.equ FUSE_PERIOD_256CLK_gc = (0x06<<0)   ; 256 cycles (0.256s)
.equ FUSE_PERIOD_512CLK_gc = (0x07<<0)   ; 512 cycles (0.512s)
.equ FUSE_PERIOD_1KCLK_gc = (0x08<<0)    ; 1K cycles (1.0s)
.equ FUSE_PERIOD_2KCLK_gc = (0x09<<0)    ; 2K cycles (2.0s)
.equ FUSE_PERIOD_4KCLK_gc = (0x0A<<0)    ; 4K cycles (4.0s)
.equ FUSE_PERIOD_8KCLK_gc = (0x0B<<0)    ; 8K cycles (8.0s)

; Watchdog Window Timeout Period select
.equ FUSE_WINDOW_OFF_gc = (0x00<<4)      ; Window mode off
.equ FUSE_WINDOW_8CLK_gc = (0x01<<4)     ; 8 cycles (8ms)
.equ FUSE_WINDOW_16CLK_gc = (0x02<<4)    ; 16 cycles (16ms)
.equ FUSE_WINDOW_32CLK_gc = (0x03<<4)    ; 32 cycles (32ms)
.equ FUSE_WINDOW_64CLK_gc = (0x04<<4)    ; 64 cycles (64ms)
.equ FUSE_WINDOW_128CLK_gc = (0x05<<4)   ; 128 cycles (0.128s)
.equ FUSE_WINDOW_256CLK_gc = (0x06<<4)   ; 256 cycles (0.256s)
.equ FUSE_WINDOW_512CLK_gc = (0x07<<4)   ; 512 cycles (0.512s)
.equ FUSE_WINDOW_1KCLK_gc = (0x08<<4)    ; 1K cycles (1.0s)
.equ FUSE_WINDOW_2KCLK_gc = (0x09<<4)    ; 2K cycles (2.0s)
.equ FUSE_WINDOW_4KCLK_gc = (0x0A<<4)    ; 4K cycles (4.0s)
.equ FUSE_WINDOW_8KCLK_gc = (0x0B<<4)    ; 8K cycles (8.0s)


;*************************************************************************
;** GPR - General Purpose Registers
;*************************************************************************


;*************************************************************************
;** LOCK - Lockbits
;*************************************************************************

; LOCK_KEY masks
.equ LOCK_KEY_gm = 0xFFFFFFFF            ; Lock Key group mask
.equ LOCK_KEY_gp = 0                     ; Lock Key group position
.equ LOCK_KEY_0_bm = (1<<0)              ; Lock Key bit 0 mask
.equ LOCK_KEY_0_bp = 0                   ; Lock Key bit 0 position
.equ LOCK_KEY_1_bm = (1<<1)              ; Lock Key bit 1 mask
.equ LOCK_KEY_1_bp = 1                   ; Lock Key bit 1 position
.equ LOCK_KEY_2_bm = (1<<2)              ; Lock Key bit 2 mask
.equ LOCK_KEY_2_bp = 2                   ; Lock Key bit 2 position
.equ LOCK_KEY_3_bm = (1<<3)              ; Lock Key bit 3 mask
.equ LOCK_KEY_3_bp = 3                   ; Lock Key bit 3 position
.equ LOCK_KEY_4_bm = (1<<4)              ; Lock Key bit 4 mask
.equ LOCK_KEY_4_bp = 4                   ; Lock Key bit 4 position
.equ LOCK_KEY_5_bm = (1<<5)              ; Lock Key bit 5 mask
.equ LOCK_KEY_5_bp = 5                   ; Lock Key bit 5 position
.equ LOCK_KEY_6_bm = (1<<6)              ; Lock Key bit 6 mask
.equ LOCK_KEY_6_bp = 6                   ; Lock Key bit 6 position
.equ LOCK_KEY_7_bm = (1<<7)              ; Lock Key bit 7 mask
.equ LOCK_KEY_7_bp = 7                   ; Lock Key bit 7 position
.equ LOCK_KEY_8_bm = (1<<8)              ; Lock Key bit 8 mask
.equ LOCK_KEY_8_bp = 8                   ; Lock Key bit 8 position
.equ LOCK_KEY_9_bm = (1<<9)              ; Lock Key bit 9 mask
.equ LOCK_KEY_9_bp = 9                   ; Lock Key bit 9 position
.equ LOCK_KEY_10_bm = (1<<10)            ; Lock Key bit 10 mask
.equ LOCK_KEY_10_bp = 10                 ; Lock Key bit 10 position
.equ LOCK_KEY_11_bm = (1<<11)            ; Lock Key bit 11 mask
.equ LOCK_KEY_11_bp = 11                 ; Lock Key bit 11 position
.equ LOCK_KEY_12_bm = (1<<12)            ; Lock Key bit 12 mask
.equ LOCK_KEY_12_bp = 12                 ; Lock Key bit 12 position
.equ LOCK_KEY_13_bm = (1<<13)            ; Lock Key bit 13 mask
.equ LOCK_KEY_13_bp = 13                 ; Lock Key bit 13 position
.equ LOCK_KEY_14_bm = (1<<14)            ; Lock Key bit 14 mask
.equ LOCK_KEY_14_bp = 14                 ; Lock Key bit 14 position
.equ LOCK_KEY_15_bm = (1<<15)            ; Lock Key bit 15 mask
.equ LOCK_KEY_15_bp = 15                 ; Lock Key bit 15 position
.equ LOCK_KEY_16_bm = (1<<16)            ; Lock Key bit 16 mask
.equ LOCK_KEY_16_bp = 16                 ; Lock Key bit 16 position
.equ LOCK_KEY_17_bm = (1<<17)            ; Lock Key bit 17 mask
.equ LOCK_KEY_17_bp = 17                 ; Lock Key bit 17 position
.equ LOCK_KEY_18_bm = (1<<18)            ; Lock Key bit 18 mask
.equ LOCK_KEY_18_bp = 18                 ; Lock Key bit 18 position
.equ LOCK_KEY_19_bm = (1<<19)            ; Lock Key bit 19 mask
.equ LOCK_KEY_19_bp = 19                 ; Lock Key bit 19 position
.equ LOCK_KEY_20_bm = (1<<20)            ; Lock Key bit 20 mask
.equ LOCK_KEY_20_bp = 20                 ; Lock Key bit 20 position
.equ LOCK_KEY_21_bm = (1<<21)            ; Lock Key bit 21 mask
.equ LOCK_KEY_21_bp = 21                 ; Lock Key bit 21 position
.equ LOCK_KEY_22_bm = (1<<22)            ; Lock Key bit 22 mask
.equ LOCK_KEY_22_bp = 22                 ; Lock Key bit 22 position
.equ LOCK_KEY_23_bm = (1<<23)            ; Lock Key bit 23 mask
.equ LOCK_KEY_23_bp = 23                 ; Lock Key bit 23 position
.equ LOCK_KEY_24_bm = (1<<24)            ; Lock Key bit 24 mask
.equ LOCK_KEY_24_bp = 24                 ; Lock Key bit 24 position
.equ LOCK_KEY_25_bm = (1<<25)            ; Lock Key bit 25 mask
.equ LOCK_KEY_25_bp = 25                 ; Lock Key bit 25 position
.equ LOCK_KEY_26_bm = (1<<26)            ; Lock Key bit 26 mask
.equ LOCK_KEY_26_bp = 26                 ; Lock Key bit 26 position
.equ LOCK_KEY_27_bm = (1<<27)            ; Lock Key bit 27 mask
.equ LOCK_KEY_27_bp = 27                 ; Lock Key bit 27 position
.equ LOCK_KEY_28_bm = (1<<28)            ; Lock Key bit 28 mask
.equ LOCK_KEY_28_bp = 28                 ; Lock Key bit 28 position
.equ LOCK_KEY_29_bm = (1<<29)            ; Lock Key bit 29 mask
.equ LOCK_KEY_29_bp = 29                 ; Lock Key bit 29 position
.equ LOCK_KEY_30_bm = (1<<30)            ; Lock Key bit 30 mask
.equ LOCK_KEY_30_bp = 30                 ; Lock Key bit 30 position
.equ LOCK_KEY_31_bm = (1<<31)            ; Lock Key bit 31 mask
.equ LOCK_KEY_31_bp = 31                 ; Lock Key bit 31 position

; Lock Key select
.equ LOCK_KEY_NOLOCK_gc = (0x5CC5C55C<<0) ; No locks
.equ LOCK_KEY_RWLOCK_gc = (0xA33A3AA3<<0) ; Read and write lock


;*************************************************************************
;** NVMCTRL - Non-volatile Memory Controller
;*************************************************************************

