QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EA48def.inc
; NVMCTRL_CTRLA masks
.equ NVMCTRL_CMD_gm = 0x7F               ; Command group mask
.equ NVMCTRL_CMD_gp = 0                  ; Command group position
.equ NVMCTRL_CMD_0_bm = (1<<0)           ; Command bit 0 mask
.equ NVMCTRL_CMD_0_bp = 0                ; Command bit 0 position
.equ NVMCTRL_CMD_1_bm = (1<<1)           ; Command bit 1 mask
.equ NVMCTRL_CMD_1_bp = 1                ; Command bit 1 position
.equ NVMCTRL_CMD_2_bm = (1<<2)           ; Command bit 2 mask
.equ NVMCTRL_CMD_2_bp = 2                ; Command bit 2 position
.equ NVMCTRL_CMD_3_bm = (1<<3)           ; Command bit 3 mask
.equ NVMCTRL_CMD_3_bp = 3                ; Command bit 3 position
.equ NVMCTRL_CMD_4_bm = (1<<4)           ; Command bit 4 mask
.equ NVMCTRL_CMD_4_bp = 4                ; Command bit 4 position
.equ NVMCTRL_CMD_5_bm = (1<<5)           ; Command bit 5 mask
.equ NVMCTRL_CMD_5_bp = 5                ; Command bit 5 position
.equ NVMCTRL_CMD_6_bm = (1<<6)           ; Command bit 6 mask
.equ NVMCTRL_CMD_6_bp = 6                ; Command bit 6 position

; NVMCTRL_CTRLB masks
.equ NVMCTRL_APPCODEWP_bm = 0x01         ; Application Code Write Protect bit mask
.equ NVMCTRL_APPCODEWP_bp = 0            ; Application Code Write Protect bit position
.equ NVMCTRL_BOOTRP_bm = 0x02            ; Boot Read Protect bit mask
.equ NVMCTRL_BOOTRP_bp = 1               ; Boot Read Protect bit position
.equ NVMCTRL_APPDATAWP_bm = 0x04         ; Application Data Write Protect bit mask
.equ NVMCTRL_APPDATAWP_bp = 2            ; Application Data Write Protect bit position
.equ NVMCTRL_EEWP_bm = 0x08              ; EEPROM Write Protect bit mask
.equ NVMCTRL_EEWP_bp = 3                 ; EEPROM Write Protect bit position
.equ NVMCTRL_FLMAP_gm = 0x30             ; Flash Mapping in Data space group mask
.equ NVMCTRL_FLMAP_gp = 4                ; Flash Mapping in Data space group position
.equ NVMCTRL_FLMAP_0_bm = (1<<4)         ; Flash Mapping in Data space bit 0 mask
.equ NVMCTRL_FLMAP_0_bp = 4              ; Flash Mapping in Data space bit 0 position
.equ NVMCTRL_FLMAP_1_bm = (1<<5)         ; Flash Mapping in Data space bit 1 mask
.equ NVMCTRL_FLMAP_1_bp = 5              ; Flash Mapping in Data space bit 1 position
.equ NVMCTRL_FLMAPLOCK_bm = 0x80         ; Flash Mapping Lock bit mask
.equ NVMCTRL_FLMAPLOCK_bp = 7            ; Flash Mapping Lock bit position

; NVMCTRL_INTCTRL masks
.equ NVMCTRL_EEREADY_bm = 0x01           ; EEPROM Ready bit mask
.equ NVMCTRL_EEREADY_bp = 0              ; EEPROM Ready bit position
.equ NVMCTRL_FLREADY_bm = 0x02           ; Flash Ready bit mask
.equ NVMCTRL_FLREADY_bp = 1              ; Flash Ready bit position

; NVMCTRL_INTFLAGS masks
; Masks for NVMCTRL_EEREADY already defined
; Masks for NVMCTRL_FLREADY already defined

; NVMCTRL_STATUS masks
.equ NVMCTRL_EEBUSY_bm = 0x01            ; EEPROM busy bit mask
.equ NVMCTRL_EEBUSY_bp = 0               ; EEPROM busy bit position
.equ NVMCTRL_FLBUSY_bm = 0x02            ; Flash busy bit mask
.equ NVMCTRL_FLBUSY_bp = 1               ; Flash busy bit position
.equ NVMCTRL_ERROR_gm = 0x70             ; Write error group mask
.equ NVMCTRL_ERROR_gp = 4                ; Write error group position
.equ NVMCTRL_ERROR_0_bm = (1<<4)         ; Write error bit 0 mask
.equ NVMCTRL_ERROR_0_bp = 4              ; Write error bit 0 position
.equ NVMCTRL_ERROR_1_bm = (1<<5)         ; Write error bit 1 mask
.equ NVMCTRL_ERROR_1_bp = 5              ; Write error bit 1 position
.equ NVMCTRL_ERROR_2_bm = (1<<6)         ; Write error bit 2 mask
.equ NVMCTRL_ERROR_2_bp = 6              ; Write error bit 2 position

; Command select
.equ NVMCTRL_CMD_NOCMD_gc = (0x00<<0)    ; No Command
.equ NVMCTRL_CMD_NOOP_gc = (0x01<<0)     ; No Operation
.equ NVMCTRL_CMD_FLPW_gc = (0x04<<0)     ; Flash Page Write
.equ NVMCTRL_CMD_FLPERW_gc = (0x05<<0)   ; Flash Page Erase and Write
.equ NVMCTRL_CMD_FLPER_gc = (0x08<<0)    ; Flash Page Erase
.equ NVMCTRL_CMD_FLMPER2_gc = (0x09<<0)  ; Flash 2-page erase enable
.equ NVMCTRL_CMD_FLMPER4_gc = (0x0A<<0)  ; Flash 4-page erase enable
.equ NVMCTRL_CMD_FLMPER8_gc = (0x0B<<0)  ; Flash 8-page erase enable
.equ NVMCTRL_CMD_FLMPER16_gc = (0x0C<<0) ; Flash 16-page erase enable
.equ NVMCTRL_CMD_FLMPER32_gc = (0x0D<<0) ; Flash 32-page erase enable
.equ NVMCTRL_CMD_FLPBCLR_gc = (0x0F<<0)  ; Flash Page Buffer Clear
.equ NVMCTRL_CMD_EEPW_gc = (0x14<<0)     ; EEPROM Page Write
.equ NVMCTRL_CMD_EEPERW_gc = (0x15<<0)   ; EEPROM Page Erase and Write
.equ NVMCTRL_CMD_EEPER_gc = (0x17<<0)    ; EEPROM Page Erase
.equ NVMCTRL_CMD_EEPBCLR_gc = (0x1F<<0)  ; EEPROM Page Buffer Clear
.equ NVMCTRL_CMD_CHER_gc = (0x20<<0)     ; Chip Erase Command (UPDI only)
.equ NVMCTRL_CMD_EECHER_gc = (0x30<<0)   ; EEPROM Erase Command (UPDI only)

; Flash Mapping in Data space select
.equ NVMCTRL_FLMAP_SECTION0_gc = (0x00<<4) ; Flash section 0, 0 - 32KB
.equ NVMCTRL_FLMAP_SECTION1_gc = (0x01<<4) ; Flash section 1, 32 - 64KB
.equ NVMCTRL_FLMAP_SECTION2_gc = (0x02<<4) ; Flash section 2, 64 - 96KB
.equ NVMCTRL_FLMAP_SECTION3_gc = (0x03<<4) ; Flash section 3, 96 - 128KB

; Write error select
.equ NVMCTRL_ERROR_NOERROR_gc = (0x00<<4) ; No Error
.equ NVMCTRL_ERROR_WRITEPROTECT_gc = (0x02<<4) ; Attempt to program write protected area
.equ NVMCTRL_ERROR_CMDCOLLISION_gc = (0x03<<4) ; Selecting new write command while write command already seleted
.equ NVMCTRL_ERROR_WRONGSECTION_gc = (0x04<<4) ; Address cannot be written with selected command


;*************************************************************************
;** PORT - I/O Ports
;*************************************************************************

; PORT_INTFLAGS masks
.equ PORT_INT_gm = 0xFF                  ; Pin Interrupt Flag group mask
.equ PORT_INT_gp = 0                     ; Pin Interrupt Flag group position
.equ PORT_INT_0_bm = (1<<0)              ; Pin Interrupt Flag bit 0 mask
.equ PORT_INT_0_bp = 0                   ; Pin Interrupt Flag bit 0 position
.equ PORT_INT_1_bm = (1<<1)              ; Pin Interrupt Flag bit 1 mask
.equ PORT_INT_1_bp = 1                   ; Pin Interrupt Flag bit 1 position
.equ PORT_INT_2_bm = (1<<2)              ; Pin Interrupt Flag bit 2 mask
.equ PORT_INT_2_bp = 2                   ; Pin Interrupt Flag bit 2 position
.equ PORT_INT_3_bm = (1<<3)              ; Pin Interrupt Flag bit 3 mask
.equ PORT_INT_3_bp = 3                   ; Pin Interrupt Flag bit 3 position
.equ PORT_INT_4_bm = (1<<4)              ; Pin Interrupt Flag bit 4 mask
.equ PORT_INT_4_bp = 4                   ; Pin Interrupt Flag bit 4 position
.equ PORT_INT_5_bm = (1<<5)              ; Pin Interrupt Flag bit 5 mask
.equ PORT_INT_5_bp = 5                   ; Pin Interrupt Flag bit 5 position
.equ PORT_INT_6_bm = (1<<6)              ; Pin Interrupt Flag bit 6 mask
.equ PORT_INT_6_bp = 6                   ; Pin Interrupt Flag bit 6 position
.equ PORT_INT_7_bm = (1<<7)              ; Pin Interrupt Flag bit 7 mask
.equ PORT_INT_7_bp = 7                   ; Pin Interrupt Flag bit 7 position

; PORT_PORTCTRL masks
.equ PORT_SRL_bm = 0x01                  ; Slew Rate Limit Enable bit mask
.equ PORT_SRL_bp = 0                     ; Slew Rate Limit Enable bit position

; PORT_PINCONFIG masks
.equ PORT_ISC_gm = 0x07                  ; Input/Sense Configuration group mask
.equ PORT_ISC_gp = 0                     ; Input/Sense Configuration group position
.equ PORT_ISC_0_bm = (1<<0)              ; Input/Sense Configuration bit 0 mask
.equ PORT_ISC_0_bp = 0                   ; Input/Sense Configuration bit 0 position
.equ PORT_ISC_1_bm = (1<<1)              ; Input/Sense Configuration bit 1 mask
.equ PORT_ISC_1_bp = 1                   ; Input/Sense Configuration bit 1 position
.equ PORT_ISC_2_bm = (1<<2)              ; Input/Sense Configuration bit 2 mask
.equ PORT_ISC_2_bp = 2                   ; Input/Sense Configuration bit 2 position
.equ PORT_PULLUPEN_bm = 0x08             ; Pullup enable bit mask
.equ PORT_PULLUPEN_bp = 3                ; Pullup enable bit position
.equ PORT_INLVL_bm = 0x40                ; Input Level Select bit mask
.equ PORT_INLVL_bp = 6                   ; Input Level Select bit position
.equ PORT_INVEN_bm = 0x80                ; Inverted I/O Enable bit mask
.equ PORT_INVEN_bp = 7                   ; Inverted I/O Enable bit position

; PORT_PIN0CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN1CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

